# GetDataType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDefinitionCreationOptions..::..GetDataType Method
ExternalDefinitionCreationOptions Class See Also
---
Gets the identifier describing the parameter's data type. The identifier may belong to either a spec or a category. If it is a category, the parameter is a Family Type parameter of that category.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ForgeTypeId GetDataType()
```

Visual Basic
---
```text
Public Function GetDataType As ForgeTypeId
```

Visual C++
---
```text
public:
ForgeTypeId^ GetDataType()
```

# See Also
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace